# loc function()

Access a group of rows and columns by label(s) or a boolean array.

In [2]:
import pandas as pd
import numpy as np

In [14]:
df = pd.DataFrame([[78, 28], [45, 25], [79, 38],[45,27],[99,78]],
     index=['Akash', 'Amit', 'Chandu','Kiran','Radha'],
     columns=['max_marks', 'min_marks'])
df

        max_marks  min_marks
Akash          78         28
Amit           45         25
Chandu         79         38
Kiran          45         27
Radha          99         78

In [4]:
#if we want to extract amit marks
df.loc['Amit']

max_marks    45
min_marks    25
Name: Amit, dtype: int64

In [7]:
#if we want to extract amit marks
df.loc[['Amit','Chandu']]

        max_marks  min_marks
Amit           45         25
Chandu         79         38

In [8]:
df.loc['Amit':'Chandu']   #we can do this way also

        max_marks  min_marks
Amit           45         25
Chandu         79         38

In [9]:
#if we want to extract amit min marks
df.loc['Amit','min_marks']

25

In [13]:
#if we want to extract amit and chandu max marks

df.loc['Amit':'Chandu','max_marks']

Amit      45
Chandu    79
Name: max_marks, dtype: int64

In [19]:
#if we want to extract only those students whose marks more than 25
df.loc[df['min_marks'] > 25]

        max_marks  min_marks
Akash          78         28
Chandu         79         38
Kiran          45         27
Radha          99         78

In [20]:
#if we want to extract only those students max marks whose marks more than 25
df.loc[df['min_marks'] > 25,'max_marks']

Akash     78
Chandu    79
Kiran     45
Radha     99
Name: max_marks, dtype: int64

In [21]:
df.loc[lambda df: df['max_marks'] > 67]          #we can use lambda function also

        max_marks  min_marks
Akash          78         28
Chandu         79         38
Radha          99         78

In [22]:
df.loc[lambda df: df['max_marks'] == 99]

       max_marks  min_marks
Radha         99         78

In [23]:
#if we want to se value
df

        max_marks  min_marks
Akash          78         28
Amit           45         25
Chandu         79         38
Kiran          45         27
Radha          99         78

In [25]:
df.loc['Akash':'Chandu','max_marks']=80
df

        max_marks  min_marks
Akash          80         28
Amit           80         25
Chandu         80         38
Kiran          45         27
Radha          99         78

In [27]:
df.loc[['Akash', 'Chandu'], ['min_marks']] = 50
df

        max_marks  min_marks
Akash          80         50
Amit           80         25
Chandu         80         50
Kiran          45         27
Radha          99         78

In [28]:
df

        max_marks  min_marks
Akash          80         50
Amit           80         25
Chandu         80         50
Kiran          45         27
Radha          99         78

In [31]:

#if we want to add new row
df.loc['max_marks']=85,60
df

           max_marks  min_marks
Akash             85         50
Amit              85         25
Chandu            85         50
Kiran             85         27
Radha             85         78
max_marks         85         60

In [33]:
#if we want to change the marks of entire column
df.loc[:,'max_marks']=85
df

           max_marks  min_marks
Akash             85         50
Amit              85         25
Chandu            85         50
Kiran             85         27
Radha             85         78
max_marks         85         60

In [34]:
#if we want to change the marks of row
df.loc['Kiran']=65
df

           max_marks  min_marks
Akash             85         50
Amit              85         25
Chandu            85         50
Kiran             65         65
Radha             85         78
max_marks         85         60

In [39]:
df.loc['min_marks']=65
df

          max_marks min_marks
Akash            85        50
Amit             85        25
Chandu           85        50
Kiran            65        65
Radha            85        78
max_marks        85        60
min_marks        65        65

# iloc function()

Purely integer-location based indexing for selection by position.

iloc used for position based index

In [1]:
dict1={
    "name":['harry','rohan','skillf','subh'],
    "marks":[12,34,24,67],
    "city":['rampur','mumbai','dabra','goa']
}

In [2]:
df= pd.DataFrame(dict1)

NameError: name 'pd' is not defined